schreibfaul1/ESP32-audioI2S/src/Audio.h
        #define ANSI_ESC_RESET          "\033[0m"
        #define ANSI_ESC_BLACK          "\033[30m"
        #define ANSI_ESC_RED            "\033[31m"
        #define ANSI_ESC_GREEN          "\033[32m"
        #define ANSI_ESC_YELLOW         "\033[33m"
        #define ANSI_ESC_BLUE           "\033[34m"
        #define ANSI_ESC_MAGENTA        "\033[35m"
        #define ANSI_ESC_CYAN           "\033[36m"
        #define ANSI_ESC_WHITE          "\033[37m"

        ps_ptr<char> logStr(__LINE__);
        logStr.copy_from(path); while(logStr.contains("/")){logStr.remove_before('/', false);}
        logStr.appendf(":%i ", line);

        if     (level == 1 && CORE_DEBUG_LEVEL >= 1) {logStr.append(ANSI_ESC_RED);}
        else if(level == 2 && CORE_DEBUG_LEVEL >= 2) {logStr.append(ANSI_ESC_YELLOW);}
        else if(level == 3 && CORE_DEBUG_LEVEL >= 3) {logStr.append(ANSI_ESC_GREEN);}
        else if(level == 4 && CORE_DEBUG_LEVEL >= 4) {logStr.append(ANSI_ESC_CYAN);} // debug
        else if(level == 5 && CORE_DEBUG_LEVEL >= 4) {logStr.append(ANSI_ESC_WHITE);} // verbose
        else return;

        int add_len = std::snprintf(nullptr, 0, fmt, std::forward<Args>(args)...);
        if (add_len > 0) {
            logStr.appendf(fmt, std::forward<Args>(args)...);  // <-- neue appendf()
        }
        logStr.append(ANSI_ESC_RESET);

        msg_t msg;
        msg.msg = logStr.get();
        const char* tag[7] ={"", "LOGE", "LOGW", "LOGI", "LOGD", "LOGV", ""};
        msg.s = tag[level];
        msg.e = evt_log;

        if(audio_info_callback) audio_info_callback(msg);
        else{
            if     (level == 1) log_e("%s", logStr.c_get());
            else if(level == 2) log_w("%s", logStr.c_get());
            else if(level == 3) log_i("%s", logStr.c_get());
            else if(level == 4) log_d("%s", logStr.c_get());
            else                log_v("%s", logStr.c_get());
        }
        logStr.reset();
    }

    // Macro for comfortable calls
    #define AUDIO_LOG_ERROR(fmt, ...) AUDIO_LOG_IMPL(1, __FILE__, __LINE__, fmt, ##__VA_ARGS__)
    #define AUDIO_LOG_WARN(fmt, ...)  AUDIO_LOG_IMPL(2, __FILE__, __LINE__, fmt, ##__VA_ARGS__)
    #define AUDIO_LOG_INFO(fmt, ...)  AUDIO_LOG_IMPL(3, __FILE__, __LINE__, fmt, ##__VA_ARGS__)
    #define AUDIO_LOG_DEBUG(fmt, ...) AUDIO_LOG_IMPL(4, __FILE__, __LINE__, fmt, ##__VA_ARGS__)
};
//----------------------------------------------------------------------------------------------------------------------
class Decoder {
public:
    virtual ~Decoder() = default;
    virtual bool init() = 0;
    virtual void clear() = 0;
    virtual void reset() = 0;
    virtual bool isValid() = 0;
    virtual int32_t findSyncWord(uint8_t *buf, int32_t nBytes) = 0;
    virtual uint8_t getChannels() = 0;
    virtual uint32_t getSampleRate() = 0;
    virtual uint8_t getBitsPerSample() = 0;
    virtual uint32_t getBitRate() = 0;
    virtual uint32_t getAudioDataStart() = 0;
    virtual uint32_t getAudioFileDuration() = 0;
    virtual uint32_t getOutputSamples() = 0;
    virtual int32_t decode(uint8_t *inbuf, int32_t *bytesLeft, int16_t *outbuf) = 0;
    virtual void setRawBlockParams(uint8_t param1, uint32_t param2, uint8_t param3, uint32_t param4, uint32_t param5) = 0;
    virtual const char* getStreamTitle();
    virtual std::vector<uint32_t> getMetadataBlockPicture() = 0;
    virtual const char* arg1() = 0; // decoder specific
    virtual const char* arg2() = 0; // decoder specific
protected:
    Decoder(Audio& audioRef) : audio(audioRef) {}
    Audio& audio; // protected reference, usable by all subclasses
private:
    Decoder() = delete;  // Deactivate default constructor explicitly (optional but good against abuse)
};

